# -*- coding: UTF-8 -*-

# 是否输出csv
IS_GEN_CSV = False
# 国债系数
GUOZHAI_RATE = 3
# 是否生成每一个指数的html，默认生成
IS_GEN_SINGLE = False


#观察股票代码
CHECK_STOCK_LIST = [
    ('600566', '济川药业'),
    #('600267', '海正药业'),
    #('H00460', '四环医药'),
    #('002027', '分众传媒'),
    #('601668', '中国建筑'),
    #('601186', '中国铁建'),
    #('601800', '中国交建'),
    #('601390', '中国中铁'),
    #('600068', '葛洲坝'),
    #('601117', '中国化学'),
    #('002033', '丽江旅游'),
    #('000423', '东阿阿胶'),
    #('000623', '吉林敖东'),
    #('600985', '淮北矿业'),
    #('000069', '华侨城A'),
    #('000761', '本钢板材'),
    #('600019', '宝钢股份'),
    #('002391', '长青股份'),
    #('603301', '振德医疗'),
    #('601668', '中国建筑'),
    #('601186', '中国铁建'),
    #('002110', '三钢闽光'),
    #('600782', '新钢股份'),
    #('600019', '宝钢股份'),
    #('601336', '新华保险'),
    #('600188', '兖州煤业'),
    #('600085', '同仁堂'),
    #('600585', '海螺水泥'),
    #('000848', '承德露露'),
    #('H00914', '海螺水泥H'),
    #('H01951', '锦欣生殖'),
    #('H01186', '中国铁建'),
    #('H00546', '阜丰集团'),
    #('H00189', '东岳集团'),
    #('H03323', '中国建材'),
    #('H00581', '中国东方集团')
]

#基建板块股票代码
JJBK_STOCK_LIST = [
    ('601668', '中国建筑'),
    ('601186', '中国铁建'),
    ('601800', '中国交建'),
    ('601390', '中国中铁'),
    ('600068', '葛洲坝'),
    ('601117', '中国化学'),
    ('H01186', '中国铁建'),
    ('H01800', '中国交通建设'),
    ('H00390', '中国中铁'),
    ('600585', '海螺水泥'),
    ('H00914', '海螺水泥H'),
    ('H03323', '中国建材')
]

# 持仓股票代码
HOLD_STOCK_LIST = [
    ('601668', '中国建筑'),
    ('601186', '中国铁建'),
    ('002701', '奥瑞金'),
    ('000726', '鲁泰A'),
    ('600019', '宝钢股份'),
    ('002391', '长青股份'),
    ('H01810', '小米集团-W'),
    ('H02333', '长城汽车'),
    ('H00874', '白云山'),
    ('H00880', '奥博控股'),
    ('H01359', '中国信达'),
    ('H06881', '中国银河')
]


# 指数代码
INDICE_LIST = [
    ('1000004', '上证指数'),
    ('000300', '沪深300'),
    ('000905', '中证500'),
    ('399006', '创业板指'),
    ('1000002', '中证全指'),
    ('399975', '证券公司'),
    ('HSI', '恒生指数'),
    ('HSCEI', '国企指数')
]
