# -*- coding: UTF-8 -*-

# 是否输出csv
IS_GEN_CSV = False
# 国债系数
GUOZHAI_RATE = 3
# 是否生成每一个指数的html，默认生成
IS_GEN_SINGLE = False


#观察股票代码
CHECK_STOCK_LIST = [
    #('002078', '太阳纸业'),
    #('000876', '新希望'),
    #('600299', '安迪苏'),
    #('600491', '龙元建设'),
    #('600039', '四川路桥'),
    #('600566', '济川药业'),
    #('600267', '海正药业'),
    #('H00460', '四环医药'),
    #('002027', '分众传媒'),
    #('601668', '中国建筑'),
    #('601186', '中国铁建'),
    #('601800', '中国交建'),
    #('601390', '中国中铁'),
    #('600068', '葛洲坝'),
    #('601117', '中国化学'),
    #('002033', '丽江旅游'),
    #('000423', '东阿阿胶'),
    #('600771', '广誉远'),
    ('300338', '开元股份'),
    #('600152', '维科技术'),
    ('600297', '广汇汽车'),
    #('600985', '淮北矿业'),
    #('000069', '华侨城A'),
    #('000761', '本钢板材'),
    #('600019', '宝钢股份'),
    #('600282', '南钢股份'),
    #('002391', '长青股份'),
    #('603301', '振德医疗'),
    #('601668', '中国建筑'),
    #('601186', '中国铁建'),
    #('002110', '三钢闽光'),
    #('600782', '新钢股份'),
    #('000898', '鞍钢股份'),
    #('601336', '新华保险'),
    #('600188', '兖州煤业'),
    #('600085', '同仁堂'),
    #('600585', '海螺水泥'),
    #('000848', '承德露露'),
    #('H00914', '海螺水泥H'),
    #('H01951', '锦欣生殖'),
    #('H01186', '中国铁建'),
    #('H00546', '阜丰集团'),
    #('H00189', '东岳集团'),
    #('H03323', '中国建材'),
    #('H00581', '中国东方集团')
]

#跟踪待买板块
GZDMBK_STOCK_LIST = [
    ('002027', '分众传媒'),
    ('H03606','福耀玻璃H'),
    ('600660','福耀玻璃A'),
    ('000423', '东阿阿胶'),
    ('002033', '丽江旅游'),
    ('002128', '露天煤业'),
    #('600585', '海螺水泥'),
    #('H00914', '海螺水泥H'),
    #('H03323', '中国建材')
]

#基建板块股票代码
JJBK_STOCK_LIST = [
    ('601668', '中国建筑'),
    ('601186', '中国铁建'),
    ('601800', '中国交建'),
    ('601390', '中国中铁'),
    ('601669', '中国电建'),
    ('600068', '葛洲坝'),
    ('601117', '中国化学'),
    ('600491', '龙元建设'),
    ('600039', '四川路桥'),
    ('H01186', '中国铁建'),
    ('H01800', '中国交通建设'),
    ('H00390', '中国中铁'),
    ('600585', '海螺水泥'),
    ('H00914', '海螺水泥H'),
    ('H03323', '中国建材')
]

# 持仓股票代码
HOLD_STOCK_LIST = [
    ('601668', '中国建筑'),
    ('601186', '中国铁建'),
    ('H01810', '小米集团-W'),
    ('H02333', '长城汽车'),
    ('603103', '横店影视'),
    ('H00874', '白云山'),
    ('H01800', '中国交通建设'),
    ('H06881', '中国银河')
    #('002701', '奥瑞金'),
    #('000726', '鲁泰A')
    
]

# 龙头股票代码
LEADING_STOCK_LIST = [
    ('601038', '一拖股份'),
    ('H00038', '第一拖拉机股份')
    
    
]


# 宽基指数代码
INDICE_LIST = [
    ('1000004', '上证指数'),
    ('000300', '沪深300'),
    ('000905', '中证500'),
    ('399006', '创业板指'),
    ('1000002', '中证全指'),
    ('399975', '证券公司'),
    ('HSI', '恒生指数'),
    ('HSCEI', '国企指数')
]

# 行业指数代码
INDICE_INDUSTRY_LIST = [ 
    ('000932', '中证消费'),
    ('399986', '中证银行'),
    ('000991', '全指医药'),
    ('399967', '中证军工'),
    ('399971', '中证传媒'),
    ('399975', '证券公司'),
    ('399998', '中证煤炭'),
    ('000992', '全指金融'),
    ('000986', '全指能源'),
    ('000995', '全指公用'),
    ('000987', '全指材料'),
    ('000819', '有色金属'),
    ('399997', '中证白酒'),
    ('930606', '中证钢铁'),
    ('399995', '基建工程'),
    ('000816', '细分地产'),
    ('000827', '中证环保'),
    ('399809', '保险主题'),
    ('000935', '中证信息'),
    ('931087', '科技龙头'),
    ('930717', 'SHS中国教育')
       
]
